var Area;
odd = true;
function getVirtualData(pageNO, level, unitCode) {
    var ashxSrc = mapParams.dataAshxSrc;            //获取灾情数据的一般处理程序路径
    var data = "";

        var topRegionCode = mapParams.topRegion.code;
        if (topRegionCode == "2") {
            Area = HunanBasin;
        }
        else {
            Area = HunanDist;
        }

    var virtualAdminRank = 2;   //地图行政级别
    var virtualCode = "43000000"
    var virtualPageNO = "1857"
    if (odd == false) {
        virtualPageNO = "1878"
        odd = true;
    }
    else {
        virtualPageNO = "1857"
        odd = false;
    }

    $.ajax({
        type: 'get',
        url: ashxSrc + '?pageNO=' + virtualPageNO + '&level=' + virtualAdminRank + '&unitCode=' + virtualCode,
        success: function(str) {
            if (str != "") {
//                if (unitCode == virtualCode) {
//                    data = str;
//                }
//                else {
                    data = transformData(level, unitCode, str); // transformData(level, unitCode, str);  randomData(level, unitCode, str);
//                }
            }
        },
        error: function() {
            data = "";
            //             alert('获得灾害类型数据出错');
        }, async: false
    });
    return data;
}

//将国家防总的数据转化为当前区域的数据
function transformData(level, unitCode, str) {
    var orgDisasterInfo = eval("(" + str + ")");
    var DisasterInfoArr = [];
    var i = 0
    for (code in orgDisasterInfo) {
        DisasterInfoArr[i] = orgDisasterInfo[code];
        i = i + 1;
    }

    var k = 0;
    var disasterInfo = {};
    var startIndex = 1;
    var endIndex = DisasterInfoArr.length - 1;
    if (odd == true) {
        for (var i = startIndex; i <= endIndex; i++) {
            for (var j = k; j < Area.length; j++) {
                if (mapParams.adminRanks[level].rank == Area[j][3] & Area[j][2] == unitCode) {
                    var code = Area[j][1]
                    disasterInfo[code] = DisasterInfoArr[i]
                    disasterInfo[code][0] = Area[j][0]
                    k = j + 1;
                    break;
                }
                k = j + 1;
            }
            if (k >= Area.length)
                break;
        }
    }
    else {
        for (var i = endIndex; i >= startIndex; i--) {
            for (var j = k; j < Area.length; j++) {
                if (mapParams.adminRanks[level].rank == Area[j][3] & Area[j][2] == unitCode) {
                    var code = Area[j][1]
                    disasterInfo[code] = DisasterInfoArr[i]
                    disasterInfo[code][0] = Area[j][0]
                    k = j + 1;
                    break;
                }
                k = j + 1;
            }
            if (k >= Area.length)
                break;
        }
    }
    return Obj2Str(disasterInfo);
}

//将国家防总的数据转化为当前区域的数据（随机）
function randomData(level, unitCode, str) {
    var orgDisasterInfo = eval("(" + str + ")");

    var DisasterInfoArr = [];
    var i = 0
    for (code in orgDisasterInfo) {
        DisasterInfoArr[i] = orgDisasterInfo[code];
        i = i + 1;
    }

    var k = 0;
    var disasterInfo = {};
    for (var j = 0; j < Area.length; j++) {
        if (mapParams.adminRanks[level].rank == Area[j][3] & Area[j][2] == unitCode) {
            var randomInt = Math.round((DisasterInfoArr.length - 1) * Math.random());
            var code = Area[j][1]
            disasterInfo[code] = DisasterInfoArr[randomInt]
            disasterInfo[code][0] = Area[j][0]
        }
    }

    return Obj2Str(disasterInfo);
}


//将国家防总的数据转化为当前区域的数据
function transformData1(level, unitCode, str) {
    var orgDisasterInfo = eval("(" + str + ")");
    var k = 0;
    var disasterInfo = {};
    for (code in orgDisasterInfo) {
        for (var j = k; j < Area.length; j++) {
            if (mapParams.adminRanks[level].rank == Area[j][3] & Area[j][2] == unitCode) {
                orgDisasterInfo[code][0] = Area[j][0];
                disasterInfo[Area[j][1]] = orgDisasterInfo[code];
                k = j + 1;
                break;
            }
            k = j + 1;
        }
        if (k >= Area.length)
            break;
    }
    return Obj2Str(disasterInfo);
}


HunanBasin = [
    ["澧水流域", "FF13006", "2", 2],
["沅水流域", "FF12006", "2", 2],
["资水流域", "FF11006", "2", 2],
["湘水流域", "FF10006", "2", 2],
["洞庭湖区", "FF00006", "2", 2],
["桂江", "FF550006", "2", 2],
["未知", "FF560006", "2", 2],
["武江", "FF570006", "2", 2],
["荆南四河区", "FF580006", "2", 2],
["上犹江", "FF510006", "2", 2],
["柳江中游", "FF520006", "2", 2],
["遂川江", "FF530006", "2", 2],
["贺江", "FF540006", "1608", 2],
["溇水中下游", "F070120", "FF13006", 3],
["澧水中上游", "F070130", "FF13006", 3],
["渫水区", "F070140", "FF13006", 3],
["涔、道水等小水系", "F070150", "FF13006", 3],
["渠水区", "F070220", "FF12006", 3],
["巫水区", "F070230", "FF12006", 3],
["潕水中下游", "F070250", "FF12006", 3],
["辰水中下游", "F070260", "FF12006", 3],
["溆水区", "F070270", "FF12006", 3],
["公溪河等小水系", "F070280", "FF12006", 3],
["酉水中下游左岸区", "F070340", "FF12006", 3],
["酉水中下游右岸区", "F070350", "FF12006", 3],
["武水区", "F070360", "FF12006", 3],
["五强溪以上小支流", "F070370", "FF12006", 3],
["五强溪以下小支流", "F070380", "FF12006", 3],
["夫夷水中下游", "F070420", "FF11006", 3],
["赧水", "F070430", "FF11006", 3],
["石马江区", "F070450", "FF11006", 3],
["柘溪库区诸水系", "F070510", "FF11006", 3],
["柘溪以下等小水系", "F070520", "FF11006", 3],
["潇水上中游", "F070620", "FF10006", 3],
["潇水下游", "F070630", "FF10006", 3],
["衡阳以上左岸小支流", "F070640", "FF10006", 3],
["衡阳以上右岸小支流", "F070650", "FF10006", 3],
["舂陵水上游区", "F070660", "FF10006", 3],
["舂陵水下游区", "F070670", "FF10006", 3],
["耒水上游", "F070680", "FF10006", 3],
["蒸水", "F0706A0", "FF10006", 3],
["涓水", "F070710", "FF10006", 3],
["涟水", "F070720", "FF10006", 3],
["渌水中下游", "F070750", "FF10006", 3],
["米水上中游", "F070760", "FF10006", 3],
["米水下游及永乐江", "F070770", "FF10006", 3],
["浏阳河、捞刀河", "F070780", "FF10006", 3],
["泪罗江", "F070810", "FF00006", 3],
["新墙河", "F070820", "FF00006", 3],
["西洞庭湖水系区", "F070840", "FF00006", 3],
["耒水中下游", "F070690", "FF10006", 3],
["南洞庭湖水系区", "F070850", "FF00006", 3],
["湖区", "F070860", "FF00006", 3],
["黄盖湖", "F100410", "FF00006", 3],
["沩水", "F070730", "FF10006", 3],
["邵水区", "F070440", "FF11006", 3],
["桂江", "AF070120", "FF550006", 3],
["未知", "AF070120", "FF560006", 3],
["武江", "AF070120", "FF570006", 3],
["荆南四河区", "AF070120", "FF580006", 3],
["上犹江", "AF070120", "FF510006", 3],
["柳江中游", "AF070120", "FF520006", 3],
["遂川江", "AF070120", "FF530006", 3],
["贺江", "AF070120", "FF540006", 3]
]


HunanDist = [
["长沙市", "43010000", "43000000", 2],
["株洲市", "43020000", "43000000", 2],
["湘潭市", "43030000", "43000000", 2],
["衡阳市", "43040000", "43000000", 2],
["邵阳市", "43050000", "43000000", 2],
["岳阳市", "43060000", "43000000", 2],
["常德市", "43070000", "43000000", 2],
["张家界市", "43080000", "43000000", 2],
["益阳市", "43090000", "43000000", 2],
["郴州市", "43100000", "43000000", 2],
["永州市", "43110000", "43000000", 2],
["怀化市", "43120000", "43000000", 2],
["娄底市", "43130000", "43000000", 2],
["湘西自治州", "43310000", "43000000", 2],
["长沙市市辖区", "43010100", "43010000", 3],
["长沙县", "43012100", "43010000", 3],
["望城县", "43012200", "43010000", 3],
["宁乡县", "43012400", "43010000", 3],
["浏阳市", "43018100", "43010000", 3],
["株洲市市辖区", "43020100", "43020000", 3],
["株洲县", "43022100", "43020000", 3],
["攸县", "43022300", "43020000", 3],
["茶陵县", "43022400", "43020000", 3],
["炎陵县", "43022500", "43020000", 3],
["醴陵市", "43028100", "43020000", 3],
["湘潭市市辖区", "43030100", "43030000", 3],
["湘潭县", "43032100", "43030000", 3],
["湘乡市", "43038100", "43030000", 3],
["韶山市", "43038200", "43030000", 3],
["衡阳市市辖区", "43040100", "43040000", 3],
["衡南县", "43042200", "43040000", 3],
["衡山县", "43042300", "43040000", 3],
["衡东县", "43042400", "43040000", 3],
["祁东县", "43042600", "43040000", 3],
["耒阳市", "43048100", "43040000", 3],
["常宁市", "43048200", "43040000", 3],
["邵阳市市辖区", "43050100", "43050000", 3],
["邵东县", "43052100", "43050000", 3],
["新邵县", "43052200", "43050000", 3],
["邵阳县", "43052300", "43050000", 3],
["隆回县", "43052400", "43050000", 3],
["洞口县", "43052500", "43050000", 3],
["绥宁县", "43052700", "43050000", 3],
["新宁县", "43052800", "43050000", 3],
["城步苗族自治县", "43052900", "43050000", 3],
["武冈市", "43058100", "43050000", 3],
["岳阳市市辖区", "43060100", "43060000", 3],
["岳阳县", "43062100", "43060000", 3],
["华容县", "43062300", "43060000", 3],
["湘阴县", "43062400", "43060000", 3],
["平江县", "43062600", "43060000", 3],
["汨罗市", "43068100", "43060000", 3],
["临湘市", "43068200", "43060000", 3],
["常德市市辖区", "43070100", "43070000", 3],
["安乡县", "43072100", "43070000", 3],
["汉寿县", "43072200", "43070000", 3],
["澧县", "43072300", "43070000", 3],
["临澧县", "43072400", "43070000", 3],
["桃源县", "43072500", "43070000", 3],
["石门县", "43072600", "43070000", 3],
["津市市", "43078100", "43070000", 3],
["张家界市市辖区", "43080100", "43080000", 3],
["慈利县", "43082100", "43080000", 3],
["桑植县", "43082200", "43080000", 3],
["益阳市", "43090000", "43090000", 3],
["益阳市市辖区", "43090100", "43090000", 3],
["南县", "43092100", "43090000", 3],
["桃江县", "43092200", "43090000", 3],
["安化县", "43092300", "43090000", 3],
["沅江市", "43098100", "43090000", 3],
["郴州市", "43100000", "43100000", 3],
["郴州市市辖区", "43100100", "43100000", 3],
["桂阳县", "43102100", "43100000", 3],
["宜章县", "43102200", "43100000", 3],
["永兴县", "43102300", "43100000", 3],
["嘉禾县", "43102400", "43100000", 3],
["临武县", "43102500", "43100000", 3],
["汝城县", "43102600", "43100000", 3],
["桂东县", "43102700", "43100000", 3],
["安仁县", "43102800", "43100000", 3],
["资兴市", "43108100", "43100000", 3],
["永州市", "43110000", "43110000", 3],
["冷水滩区", "43110300", "43110000", 3],
["祁阳县", "43112100", "43110000", 3],
["东安县", "43112200", "43110000", 3],
["双牌县", "43112300", "43110000", 3],
["道县", "43112400", "43110000", 3],
["江永县", "43112500", "43110000", 3],
["宁远县", "43112600", "43110000", 3],
["蓝山县", "43112700", "43110000", 3],
["新田县", "43112800", "43110000", 3],
["江华瑶族自治县", "43112900", "43110000", 3],
["怀化市", "43120000", "43120000", 3],
["沅陵县", "43122200", "43120000", 3],
["辰溪县", "43122300", "43120000", 3],
["溆浦县", "43122400", "43120000", 3],
["会同县", "43122500", "43120000", 3],
["麻阳苗族自治县", "43122600", "43120000", 3],
["新晃侗族自治县", "43122700", "43120000", 3],
["芷江侗族自治县", "43122800", "43120000", 3],
["靖州苗族侗族自治县", "43122900", "43120000", 3],
["通道侗族自治县", "43123000", "43120000", 3],
["洪江市", "43128100", "43120000", 3],
["娄底市", "43130100", "43130000", 3],
["双峰县", "43132200", "43130000", 3],
["新化县", "43132400", "43130000", 3],
["冷水江市", "43138100", "43130000", 3],
["涟源市", "43138200", "43130000", 3],
["吉首市", "43310100", "43310000", 3],
["泸溪县", "43312200", "43310000", 3],
["凤凰县", "43312300", "43310000", 3],
["花垣县", "43312400", "43310000", 3],
["保靖县", "43312500", "43310000", 3],
["古丈县", "43312600", "43310000", 3],
["永顺县", "43312700", "43310000", 3],
["龙山县", "43313000", "43310000", 3]
]